# EnergyAnalysisBldgConsMtlThermalProps Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..EnergyAnalysisBldgConsMtlThermalProps Property
GroupTypeId Class See Also
---
"Material Thermal Properties"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisBldgConsMtlThermalProps { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisBldgConsMtlThermalProps As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisBldgConsMtlThermalProps {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace